In [1]:
'''
2_24_2020  
Python Pandas Analytics book Page 110 Start
'''
import numpy as np
import pandas as pd

# adding and deleting columns in DF

In [5]:
frame1 = pd.DataFrame(np.arange(16).reshape((4,4)),index =['red','blue','yellow','white'], columns=['ball','pen','pencil','paper'])

In [11]:
frame1
frame1['eraser'] = 4    #adding a column callsed 'eraser' and putting a default value of 4
frame1['to_be_deleted'] = 'NaN'
frame1

        ball  pen  pencil  paper  eraser to_be_deleted
red        0    1       2      3       4           NaN
blue       4    5       6      7       4           NaN
yellow     8    9      10     11       4           NaN
white     12   13      14     15       4           NaN

In [12]:
del frame1['to_be_deleted']   #Deleting a column in DataFrame

In [13]:
print(frame1)

        ball  pen  pencil  paper  eraser
red        0    1       2      3       4
blue       4    5       6      7       4
yellow     8    9      10     11       4
white     12   13      14     15       4

# Filtering dataframe

In [15]:
frame1[frame1<3.5]  #filtering based on the criteria

        ball  pen  pencil  paper  eraser
red      0.0  1.0     2.0    3.0     NaN
blue     NaN  NaN     NaN    NaN     NaN
yellow   NaN  NaN     NaN    NaN     NaN
white    NaN  NaN     NaN    NaN     NaN

In [16]:
frame1

        ball  pen  pencil  paper  eraser
red        0    1       2      3       4
blue       4    5       6      7       4
yellow     8    9      10     11       4
white     12   13      14     15       4

# Nested Dictioary into DF

In [17]:
#Nested Dictionary
nestdict = {'red':{2012: 22, 2013: 33},'white':{2011: 13, 2012: 22, 2013: 16}, 'blue':{2011:17, 2012:27, 2013: 18}}

In [18]:
nestdict

{'red': {2012: 22, 2013: 33},
 'white': {2011: 13, 2012: 22, 2013: 16},
 'blue': {2011: 17, 2012: 27, 2013: 18}}

In [20]:
frame2 = pd.DataFrame(nestdict)
print(frame2)

       red  white  blue
2011   NaN     13    17
2012  22.0     22    27
2013  33.0     16    18

# Transposition of a DataFrame (very easy)

In [21]:
frame2.T   #very simple syntax

       2011  2012  2013
red     NaN  22.0  33.0
white  13.0  22.0  16.0
blue   17.0  27.0  18.0

In [24]:
serd = pd.Series(range(6), index = ['white','white','blue','green','green','yellow'])
print(serd)
serd['white']

white     0
white     1
blue      2
green     3
green     4
yellow    5
dtype: int64

white    0
white    1
dtype: int64

In [25]:
serd.index.is_unique

False

# reindexing

In [28]:
#since index is immutable, you need a method to reindex()
ser = pd.Series([2,5,7,4], index=['one','two','three','four'])
ser
#there is no five in the index

one      2
two      5
three    7
four     4
dtype: int64

In [29]:
ser.reindex(['three', 'four', 'five','one'])
#now five is added but there is no value associated with it so hence NaN

three    7.0
four     4.0
five     NaN
one      2.0
dtype: float64

In [31]:
ser3 =pd.Series([1,5,6,3], index=[0,3,5,6])
ser3   #there are index missing like 1,2 & 4 so you perform interporation

0    1
3    5
5    6
6    3
dtype: int64

# interporation using ffill

In [32]:
ser3.reindex(range(6),method='ffill')  #interporation means fill the gap to create estimation

0    1
1    1
2    1
3    5
4    5
5    6
dtype: int64

In [33]:
ser3.reindex(range(6), method='bfill')

0    1
1    5
2    5
3    5
4    6
5    6
dtype: int64

# Dropping

In [35]:
ser = pd.Series(np.arange(4.), index=['red','blue','yellow','white'])
ser

red       0.0
blue      1.0
yellow    2.0
white     3.0
dtype: float64

In [37]:
ser.drop('yellow')

red      0.0
blue     1.0
white    3.0
dtype: float64

In [39]:
frame3 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red','blue','yellow','white'],columns=['ball','pen','pencil','paper'])

In [41]:
frame3

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

# frame.drop() To delete rows, you just pass he index

In [43]:
frame3.drop(['blue'])   #to drop columns, you always need to specify the indexes of the colums, but for you can 
#also use the axis option (axis =0 for rows, axis =1 for columns)

        ball  pen  pencil  paper
red        0    1       2      3
yellow     8    9      10     11
white     12   13      14     15

In [45]:
frame3.drop(['pencil'], axis = 1)

        ball  pen  paper
red        0    1      3
blue       4    5      7
yellow     8    9     11
white     12   13     15

# Arithmetic and Data Alignment:  Pandas can aligh indexes coming from two different data structures.

In [46]:
s1 = pd.Series([3,2,5,1], ['white','yellow','green','blue'])
s2 = pd.Series([1,4,7,2,1],['white', 'yellow','black', 'blue','brown'])

In [47]:
print(s1)
print(s2)

white     3
yellow    2
green     5
blue      1
dtype: int64
white     1
yellow    4
black     7
blue      2
brown     1
dtype: int64

In [48]:
s1+s2

black     NaN
blue      3.0
brown     NaN
green     NaN
white     4.0
yellow    6.0
dtype: float64

In [53]:
frame1_1 = pd.DataFrame(np.arange(16).reshape((4,4)),index=['red', 'blue', 'yellow', 'white'],columns = ['ball','pen','pencil','paper'])
frame1_2 = pd.DataFrame(np.arange(12).reshape((4,3)),index=['blue','green','white','yellow'],columns = ['mug','pen','ball'])

In [54]:
frame1_1

        ball  pen  pencil  paper
red        0    1       2      3
blue       4    5       6      7
yellow     8    9      10     11
white     12   13      14     15

In [55]:
frame1_2

        mug  pen  ball
blue      0    1     2
green     3    4     5
white     6    7     8
yellow    9   10    11

In [56]:
frame1_1+frame1_2  #adding dataframes of different sizes

        ball  mug  paper   pen  pencil
blue     6.0  NaN    NaN   6.0     NaN
green    NaN  NaN    NaN   NaN     NaN
red      NaN  NaN    NaN   NaN     NaN
white   20.0  NaN    NaN  20.0     NaN
yellow  19.0  NaN    NaN  19.0     NaN